In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic-dataset.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [3]:
df.shape

(418, 12)

In [4]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [6]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [7]:
df.drop('Cabin',inplace=True,axis=1) # axis=1 column,axis=0 row

In [8]:
df.shape

(418, 11)

In [9]:
df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64

In [10]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,C

In [11]:
df.Age.min()

0.17

In [12]:
df.Age.mean()

30.272590361445783

In [13]:
df.Name[:10]

0                                Kelly, Mr. James
1                Wilkes, Mrs. James (Ellen Needs)
2                       Myles, Mr. Thomas Francis
3                                Wirz, Mr. Albert
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
5                      Svensson, Mr. Johan Cervin
6                            Connolly, Miss. Kate
7                    Caldwell, Mr. Albert Francis
8       Abrahim, Mrs. Joseph (Sophie Halaut Easu)
9                         Davies, Mr. John Samuel
Name: Name, dtype: object

In [14]:
new = df.Name.str.split(',').str[1].str.split('.').str[0].str.strip()
new

0          Mr
1         Mrs
2          Mr
3          Mr
4         Mrs
        ...
413        Mr
414      Dona
415        Mr
416        Mr
417    Master
Name: Name, Length: 418, dtype: object

In [15]:
df.insert(6,column='start',value=new)

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,start,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,Mr,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,Mrs,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,Mr,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,Mr,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,Mrs,1,1,3101298,12.2875,S

In [17]:
mr_df = df[df.loc[:,'start']=='Mr']

In [18]:
mr_df

,PassengerId,Survived,Pclass,Name,Sex,Age,start,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,Mr,0,0,330911,7.8292,Q
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,Mr,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,Mr,0,0,315154,8.6625,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,Mr,0,0,7538,9.2250,S
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,Mr,1,1,248738,29.0000,S
...,...,...,...,...,...,...,...,...,...,...,...,...
406,1298,0,2,"Ware, Mr. William Jeffery",male,23.0,Mr,1,0,28666,10.5000,S
407,1299,0,1,"Widener, Mr. George Dunton",male,50.0,Mr,1,1,113503,211.5000,C
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,Mr,0,0,A.5. 3236,8.0500,S
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,Mr,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,Mr,0,0,359309,8.0500,S

In [19]:
mr_age_mean = mr_df.Age.mean()

In [20]:
mr_df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            57
start           0
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64

In [21]:
mr_df[mr_df.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,start,SibSp,Parch,Ticket,Fare,Embarked
10,902,0,3,"Ilieff, Mr. Ylio",male,NaN,Mr,0,0,349220,7.8958,S
29,921,0,3,"Samaan, Mr. Elias",male,NaN,Mr,2,0,2662,21.6792,C
39,931,0,3,"Hee, Mr. Ling",male,NaN,Mr,0,0,1601,56.4958,S
41,933,0,1,"Franklin, Mr. Thomas Parham",male,NaN,Mr,0,0,113778,26.5500,S
47,939,0,3,"Shaughnessy, Mr. Patrick",male,NaN,Mr,0,0,370374,7.7500,Q
54,946,0,2,"Mangiavacchi, Mr. Serafino Emilio",male,NaN,Mr,0,0,SC/A.3 2861,15.5792,C
58,950,0,3,"Davison, Mr. Thomas Henry",male,NaN,Mr,1,0,386525,16.1000,S
76,968,0,3,"Miles, Mr. Frank",male,NaN,Mr,0,0,359306,8.0500,S
83,975,0,3,"Demetri, Mr. Marinko",male,NaN,Mr,0,0,349238,7.8958,S
84,976,0,2,"Lamb, Mr. John Joseph",male,NaN,Mr,0,0,240261,10.7083,Q
85,977,0,3,"Khalil, Mr. Betros",male,NaN,Mr,1,0,2660,14.4542,C
91,983,0,3,"Pedersen, Mr. Olaf",male,NaN,Mr,0,0,345498,7.7750,S
93,985,0,3,"Guest, Mr. Robert",male,NaN,Mr,0,0,376563,8.0500,S
102,994,0,3,"Foley, Mr. William",male,NaN,Mr,0,0,365235,7.7500,Q
107,999,0,3,"Ryan, Mr. Edward",male,NaN,Mr,0,0,383162,7.7500,Q
108,1000,0,3,"Willer, Mr. Aaron (Abi Weller"")""",male,NaN,Mr,0,0,3410,8.7125,S
116,1008,0,3,"Thomas, Mr. John",male,NaN,Mr,0,0,2681,6.4375,C
121,1013,0,3,"Kiernan, Mr. John",male,NaN,Mr,1,0,367227,7.7500,Q
124,1016,0,3,"Kennedy, Mr. John",male,NaN,Mr,0,0,368783,7.7500,Q
133,1025,0,3,"Thomas, Mr. Charles P",male,NaN,Mr,1,0,2621,6.4375,C
146,1038,0,1,"Hilliard, Mr. Herbert Henry",male,NaN,Mr,0,0,17463,51.8625,S
148,1040,0,1,"Crafton, Mr. John Bertram",male,NaN,Mr,0,0,113791,26.5500,S
151,1043,0,3,"Matinoff, Mr. Nicola",male,NaN,Mr,0,0,349255,7.8958,C
163,1055,0,3,"Pearce, Mr. Ernest",male,NaN,Mr,0,0,343271,7.0000,S
170,1062,0,3,"Lithman, Mr. Simon",male,NaN,Mr,0,0,S.O./P.P. 251,7.5500,S
173,1065,0,3,"Torfa, Mr. Assad",male,NaN,Mr,0,0,2673,7.2292,C
183,1075,0,3,"Lane, Mr. Patrick",male,NaN,Mr,0,0,7935,7.7500,Q
191,1083,0,1,"Salomon, Mr. Abraham L",male,NaN,Mr,0,0,111163,26.0000,S
205,1097,0,1,"Omont, Mr. Alfred Fernand",male,NaN,Mr,0,0,F.C. 12998,25.7417,C
211,1103,0,3,"Finoli, Mr. Luigi",male,NaN,Mr,0,0,SOTON/O.Q. 3101308,7.0500,S
219,1111,0,3,"Thomson, Mr. Alexander Morrison",male,NaN,Mr,0,0,32302,8.0500,S
233,1125,0,3,"Linehan, Mr. Michael",male,NaN,Mr,0,0,330971,7.8792,Q
243,1135,0,3,"Hyman, Mr. Abraham",male,NaN,Mr,0,0,3470,7.8875,S
255,1147,0,3,"MacKay, Mr. George William",male,NaN,Mr,0,0,C.A. 42795,7.5500,S
256,1148,0,3,"Mahon, Mr. John",male,NaN,Mr,0,0,AQ/4 3130,7.7500,Q
265,1157,0,3,"Lyntakoff, Mr. Stanko",male,NaN,Mr,0,0,349235,7.8958,S
266,1158,0,1,"Chisholm, Mr. Roderick Robert Crispin",male,NaN,Mr,0,0,112051,0.0000,S
267,1159,0,3,"Warren, Mr. Charles William",male,NaN,Mr,0,0,C.A. 49867,7.5500,S
271,1163,0,3,"Fox, Mr. Patrick",male,NaN,Mr,0,0,368573,7.7500,Q
274,1166,0,3,"Saade, Mr. Jean Nassr",male,NaN,Mr,0,0,2676,7.2250,C
286,1178,0,3,"Franklin, Mr. Charles (Charles Fardon)",male,NaN,Mr,0,0,SOTON/O.Q. 3101314,7.2500,S
288,1180,0,3,"Mardirosian, Mr. Sarkis",male,NaN,Mr,0,0,2655,7.2292,C
289,1181,0,3,"Ford, Mr. Arthur",male,NaN,Mr,0,0,A/5 1478,8.0500,S
290,1182,0,1,"Rheims, Mr. George Alexander Lucien",male,NaN,Mr,0,0,PC 17607,39.6000,S
292,1184,0,3,"Nasr, Mr. Mustafa",male,NaN,Mr,0,0,2652,7.2292,C
297,1189,0,3,"Samaan, Mr. Hanna",male,NaN,Mr,2,0,2662,21.6792,C
301,1193,0,2,"Malachard, Mr. Noel",male,NaN,Mr,0,0,237735,15.0458,C
312,1204,0,3,"Sadowitz, Mr. Harry",male,NaN,Mr,0,0,LP 1588,7.5750,S
332,1224,0,3,"Thomas, Mr. Tannous",male,NaN,Mr,0,0,2684,7.2250,C
342,1234,0,3,"Sage, Mr. John George",male,NaN,Mr,1,9,CA. 2343,69.5500,S
357,1249,0,3,"Lockyer, Mr. Edward",male,NaN,Mr,0,0,1222,7.8792,S
358,1250,0,3,"O'Keefe, Mr. Patrick",male,NaN,Mr,0,0,368402,7.7500,Q
366,1258,0,3,"Caram, Mr. Joseph",male,NaN,Mr,1,0,2689,14.4583,C
380,1272,0,3,"O'Connor, Mr. Patrick",male,NaN,Mr,0,0,366713,7.7500,Q
384,1276,0,2,"Wheeler, Mr. Edwin Frederick""""",male,NaN,Mr,0,0,SC/PARIS 2159,12.8750,S
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,Mr,0,0,A.5. 3236,8.0500,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,Mr,0,0,359309,8.0500,S

In [22]:
mr_df.shape

(240, 12)

In [23]:
mr_index = mr_df[mr_df.Age.isnull()].index

In [24]:
mr_index

Index([ 10,  29,  39,  41,  47,  54,  58,  76,  83,  84,  85,  91,  93, 102,
       107, 108, 116, 121, 124, 133, 146, 148, 151, 163, 170, 173, 183, 191,
       205, 211, 219, 233, 243, 255, 256, 265, 266, 267, 271, 274, 286, 288,
       289, 290, 292, 297, 301, 312, 332, 342, 357, 358, 366, 380, 384, 413,
       416],
      dtype='int64')

In [25]:
df.loc[mr_index,'Age'] = mr_age_mean

In [26]:
df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            29
start           0
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64

In [27]:
# df.loc[mr_index,:]

In [28]:
mrs_df = df[df.loc[:,'start']=='Mrs']

In [29]:
mrs_df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            10
start           0
SibSp           0
Parch           0
Ticket          0
Fare            0
Embarked        0
dtype: int64

In [30]:
mrs_age_mean = mrs_df.Age.mean()

In [31]:
mrs_age_mean

38.903225806451616

In [32]:
mrs_index = mrs_df[mrs_df.Age.isnull()].index

In [33]:
mrs_index

Index([22, 33, 65, 132, 168, 199, 225, 249, 365, 382], dtype='int64')

In [34]:
df.loc[mrs_index,'Age'] = mrs_age_mean

In [35]:
df.loc[mrs_index,:]

,PassengerId,Survived,Pclass,Name,Sex,Age,start,SibSp,Parch,Ticket,Fare,Embarked
22,914,1,1,"Flegenheim, Mrs. Alfred (Antoinette)",female,38.903226,Mrs,0,0,PC 17598,31.6833,S
33,925,1,3,"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)""",female,38.903226,Mrs,1,2,W./C. 6607,23.4500,S
65,957,1,2,"Corey, Mrs. Percy C (Mary Phyllis Elizabeth Mi...",female,38.903226,Mrs,0,0,F.C.C. 13534,21.0000,S
132,1024,1,3,"Lefebre, Mrs. Frank (Frances)",female,38.903226,Mrs,0,4,4133,25.4667,S
168,1060,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,38.903226,Mrs,0,0,17770,27.7208,C
199,1091,1,3,"Rasmussen, Mrs. (Lena Jacobsen Solvang)",female,38.903226,Mrs,0,0,65305,8.1125,S
225,1117,1,3,"Moubarek, Mrs. George (Omine Amenia"" Alexander)""",female,38.903226,Mrs,0,2,2661,15.2458,C
249,1141,1,3,"Khalil, Mrs. Betros (Zahie Maria"" Elias)""",female,38.903226,Mrs,1,0,2660,14.4542,C
365,1257,1,3,"Sage, Mrs. John (Annie Bullen)",female,38.903226,Mrs,1,9,CA. 2343,69.5500,S
382,1274,1,3,"Risien, Mrs. Samuel (Emma)",female,38.903226,Mrs,0,0,364498,14.5000,S

In [36]:
df.isnull().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            19
start           0
SibSp           0
Parch           0
Ticket          0
Fare            1
Embarked        0
dtype: int64